cask_args appdir: "/Applications"

tap 'homebrew/cask-fonts'
tap 'thoughtbot/formulae'

brew 'ack'
brew 'aria2'
brew 'chruby'
brew 'fzf'
brew 'git'
brew 'libxml2'
brew 'libxslt'
brew 'mas'
brew 'node'
brew 'pstree'
brew 'qt'
brew 'rcm'
brew 'ssh-copy-id'
brew 'starship'
brew 'ruby-install'
brew 'tree'
brew 'watch'
brew 'wget'


cask '1password'
cask 'anki'
cask 'capcut'
cask 'clip-studio-paint'
cask 'crossover'
cask 'discord'
cask 'fertigt-slate' # Supports Apple Silicon only
cask 'firefox'
cask 'flycut'
cask 'final-fantasy-xiv-online'
cask 'font-fontawesome'
cask 'font-ibm-plex'
# Nerd fonts needed for Starship
cask 'font-fira-code-nerd-font'
cask 'font-source-code-pro'
# Nerd fonts needed for Starship
cask 'font-jetbrains-mono-nerd-font'
cask 'font-xkcd-script'
cask 'gamemaker'
cask 'github'
cask 'godot'
cask 'godot-mono'
cask 'google-chrome'
cask 'google-drive'
#cask 'intellij-idea-ce'
cask 'miro'
cask 'obsidian'
cask 'rockboxutility'
#cask 'rubymine'
#cask 'signal'
cask 'slack'
cask 'steam'
cask 'soulseek'
cask 'visual-studio-code'
cask 'xscope'
cask 'zed'
cask 'zoom'

# DWF's Mac App Store apps YMMV; mas list can get your ID's for you
mas "Daisy Disk", id: 411643860
mas "Marked 2", id: 890031187
mas "ToDoist", id: 585829637
mas "Paprika Recipe Manager 3", id: 1303222628
